[Killed] BlockStatement
src/main/utils/currentUser.js:40:44
   return mutation;
 }
 
-export function hasRole(currentUser, role) {
-  // The following hack is because there is some bug in terms of the
-  // shape of the data returned by useCurrentUser.  Is there a separate
-  // data level, or not?
-
-  // We will file an issue to track that down and then remove this hack
-
-  if (currentUser == null) return false;
-
-  // Stryker disable next-line OptionalChaining : we should fix the hack rather than trying to test this bad code
-  if (currentUser.data?.root?.rolesList) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
-
-  return currentUser.root?.rolesList?.includes(role);
-}
+export function hasRole(currentUser, role) {}
 
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") returns correct values when currentUser properly defined
statusReason: Error: expect(received).toBeTruthy()

Received: undefined

[Killed] ConditionalExpression
src/main/utils/currentUser.js:50:7
   if (currentUser == null) return false;
 
   // Stryker disable next-line OptionalChaining : we should fix the hack rather than trying to test this bad code
-  if (currentUser.data?.root?.rolesList) {
+  if (true) {
     return currentUser.data.root.rolesList.includes(role);
   }
killedBy: utils/currentUser tests hasRole tests hasRole(x,"ROLE_ADMIN") return falsy when currentUser ill-defined
statusReason: TypeError: Cannot read properties of undefined (reading 'root')

[Killed] BlockStatement
src/main/utils/currentUser.js:50:42
   if (currentUser == null) return false;
 
   // Stryker disable next-line OptionalChaining : we should fix the hack rather than trying to test this bad code
-  if (currentUser.data?.root?.rolesList) {
-    return currentUser.data.root.rolesList.includes(role);
-  }
+  if (currentUser.data?.root?.rolesList) {}
 
   return currentUser.root?.rolesList?.includes(role);
killedBy: utils/currentUser tests hasRole tests hasRole returns correct values when data is in currentUser
statusReason: Error: expect(received).toBeTruthy()

Received: undefined
